# -*- coding: utf-8 -*-

# காப்புரிமை 2018, ஶ்ரீரமண ஶர்மா
# Copyright 2018, Shriramana Sharma
#
# Use and redistribution with or without modification is permitted without
# restrictions. THERE IS NO WARRANTY WHATSOEVER.


def _சார்பிடம்_நகலிடுக(ச1, ச2):
    '''சறுக்குவான்கள் இரண்டன் சார்பிடத்தை அறிந்து வேறுபாடு இருப்பின் ச1-லிருந்து ச2-க்கு நகலிடத் தகுந்த செயலை உருவாக்குகிறது'''
    def செயல்():
        ச1_எல்லை = ச1.maximum()
        ச2_எல்லை = ச2.maximum()
        if ச1_எல்லை == 0 or ச2_எல்லை == 0:  # செயலற்ற சறுக்குவான்
            return
        # ச1_சார்பிடம் = ச1_உண்மையிடம் ÷ ச1_எல்லை
        # (ச2_எல்லை × ச1_எல்லை) என்ற புதிய எல்லை கொண்டு சார்பிடத்தை ஒரு முழு எண்ணாக்குவோம்
        # ⇒ ச1_சார்பிடம் = ச1_உண்மையிடம் ÷ ச1_எல்லை × (ச2_எல்லை × ச1_எல்லை) ⇒
        ச1_சார்பிடம் = ச1.sliderPosition() * ச2_எல்லை
        ச2_சார்பிடம் = ச2.sliderPosition() * ச1_எல்லை  # மேற்கண்டவாறே
        if ச2_சார்பிடம் != ச1_சார்பிடம்:
            ச2_புதிய_இடம் = ச1_சார்பிடம் / ச1_எல்லை  # == ச2_எல்லை × ச1_உண்மையிடம் ÷ ச1_எல்லை
            ச2.setSliderPosition(round(ச2_புதிய_இடம்))
    return செயல்


def சறுக்குவான்கள்_சார்பிடம்_ஒருங்கிணைக்க_சுற்றி_வந்து(*சறுக்குவான்கள்):
    # கவனிக்க: விசைப்பலகை உள்ளீட்டால் இந்த ஒருங்கிணைப்பு செயல்படாமல் இருக்கலாம். காரணம் எனக்குத் தெரியவில்லை.
    சறுக்குவான்கள்_எண்ணிக்கை = len(சறுக்குவான்கள்)
    if சறுக்குவான்கள்_எண்ணிக்கை < 2:
        return
    for எண் in range(சறுக்குவான்கள்_எண்ணிக்கை - 1):
        ச1 = சறுக்குவான்கள்[எண்]
        ச2 = சறுக்குவான்கள்[எண் + 1]
        ச1.actionTriggered.connect(_சார்பிடம்_நகலிடுக(ச1, ச2))
    ச2.actionTriggered.connect(_சார்பிடம்_நகலிடுக(ச2, சறுக்குவான்கள்[0]))


# ௸ முறையில் ஒரு குறைபாடு - பல சறுக்குவான்களில் ஒன்றுக்கு எல்லை 0 ஆகிவிட்டாலும் அதற்கு முன்பு உள்ள சறுக்குவானின் மதிப்பு மாறினாலும்
# அதன் மதிப்பு மாறாதாகையால் அதற்கு மேல் உள்ள சறுக்குவான்களுக்கு அந்த சார்பிடம் ஒருங்கிணைக்கப்பட மாட்டாது. அறிக்கைச் சிக்கனம் கருதி
# இப்படிச் சுற்றி வந்து அறிக்கைகளையும் செயல்களையும் இணைத்தால் இப்படித்தான் ஆகும். ஒவ்வொறு சறுக்குவானையும் மற்ற அனைத்து
# சறுக்குவான்களுடன் ஒருங்கிணைப்பதே எஞ்சியுள்ள ஒரே வழியாகத் தற்சமயம் தெரிகிறது.

def சறுக்குவான்கள்_சார்பிடம்_ஒருங்கிணைக்க_ஒன்றனுக்கொன்று(*சறுக்குவான்கள்):
    # கவனிக்க: விசைப்பலகை உள்ளீட்டால் இந்த ஒருங்கிணைப்பு செயல்படாமல் இருக்கலாம். காரணம் எனக்குத் தெரியவில்லை.
    if len(சறுக்குவான்கள்) < 2:
        return
    ஜோடிகள் = [(ச1, ச2) for ச1 in சறுக்குவான்கள் for ச2 in சறுக்குவான்கள் if ச1 is not ச2]
    for ச1, ச2 in ஜோடிகள்:
        ச1.actionTriggered.connect(_சார்பிடம்_நகலிடுக(ச1, ச2))

# ஆகவே தற்சமயம் இதனையே முதன்மையான ஒருங்கிணைப்பு முறையாகக் கையாள்வோம்

சறுக்குவான்கள்_சார்பிடம்_ஒருங்கிணைக்க = சறுக்குவான்கள்_சார்பிடம்_ஒருங்கிணைக்க_ஒன்றனுக்கொன்று
