# -*- coding: utf-8 -*-

# காப்புரிமை 2018, ஶ்ரீரமண ஶர்மா
# Copyright 2018, Shriramana Sharma
#
# Use and redistribution with or without modification is permitted without
# restrictions. THERE IS NO WARRANTY WHATSOEVER.


# KDE Oxygen வண்ணங்களை ஒட்டி உருவாக்கிய வண்ணத்திட்டங்கள். Oxygen வண்ணப்பெயர்கள் குறிக்கப்பட்டுள்ளன

__all__ = ["வண்ணத்திட்டங்கள்", "வண்ணத்திட்டங்கள்_உறுப்பு_காட்டுவோனுக்கு", "வண்ணத்திட்டங்கள்_HTMLக்கு"]

திட்டம்_வெண்மை = {
    "சீரின் அசைகள்": (
        (128,  63,   0),  # Brown Orange 5
        (  0, 140,   0),  # Green 5
        (163,   0, 123),  # Pink 5
        (  0,   0, 191),  # Blue 5
    ),
    "ஆய்வு":
        ( 99, 128,   0),  # Lime 6
    "ஆய்வு சிறப்பு":
        ( 64,   0, 128),  # Purple 5
    "தவறு":
        (140,   0,   0),  # Red 5
    "தமிழ் அல்லாதது":
        (187, 187, 187),  # Gray 3
    "பின்னணி":
        (238, 238, 238),  # Gray 1
}

திட்டம்_கறுமை = {
    "சீரின் அசைகள்": (
        (255, 191, 128),  # Brown Orange 2
        (128, 255, 128),  # Green 2
        (255, 128, 223),  # Pink 2
        (128, 179, 255),  # Blue 2
    ),
    "ஆய்வு":
        (248, 255, 191),  # Lime 1
    "ஆய்வு சிறப்பு":
        (192, 128, 255),  # Purple 2
    "தவறு":
        (255, 128, 128),  # Red 2
    "தமிழ் அல்லாதது":
        (136, 136, 136),  # Gray 4
    "பின்னணி":
        ( 50,  50,  50),  # Gray 6
}

வண்ணத்திட்டங்கள் = {"வெண்மை": திட்டம்_வெண்மை, "கறுமை": திட்டம்_கறுமை}

from copy import deepcopy
வண்ணத்திட்டங்கள்_உறுப்பு_காட்டுவோனுக்கு = deepcopy(வண்ணத்திட்டங்கள்)
வண்ணத்திட்டங்கள்_HTMLக்கு = deepcopy(வண்ணத்திட்டங்கள்)

from PyQt5.QtGui import QFont, QTextCharFormat, QColor
for திட்டம் in வண்ணத்திட்டங்கள்_உறுப்பு_காட்டுவோனுக்கு.values():
    for சாவி, மதிப்பு in திட்டம்.items():
        if சாவி == "சீரின் அசைகள்":
            நிரை_பூச்சுகள் = []
            நேர்_பூச்சுகள் = []
            for சிபநீ in மதிப்பு:  # சிவப்பு, பச்சை, நீலம்
                பூச்சு = QTextCharFormat()
                பூச்சு.setForeground(QColor(*சிபநீ))
                நிரை_பூச்சுகள்.append(பூச்சு)
                பூச்சு = QTextCharFormat(பூச்சு)
                பூச்சு.setFontWeight(QFont.Bold)
                நேர்_பூச்சுகள்.append(பூச்சு)
            திட்டம்[சாவி] = {"நேர்": நேர்_பூச்சுகள், "நிரை": நிரை_பூச்சுகள்}
        elif சாவி == "தவறு":
            பூச்சு = QTextCharFormat()
            பூச்சு.setForeground(QColor(*மதிப்பு))
            பூச்சு.setFontStrikeOut(True)
            திட்டம்[சாவி] = பூச்சு
        elif சாவி in ("ஆய்வு", "தமிழ் அல்லாதது", "பின்னணி"):
            திட்டம்[சாவி] = QColor(*மதிப்பு).name()
        else:
            பூச்சு = QTextCharFormat()
            பூச்சு.setForeground(QColor(*மதிப்பு))
            திட்டம்[சாவி] = பூச்சு

for திட்டம் in வண்ணத்திட்டங்கள்_HTMLக்கு.values():
    for சாவி, மதிப்பு in திட்டம்.items():
        if சாவி == "சீரின் அசைகள்":
            திட்டம்[சாவி] = [QColor(*சிபநீ).name() for சிபநீ in மதிப்பு]  # சிவப்பு, பச்சை, நீலம்
        else:
            திட்டம்[சாவி] = QColor(*மதிப்பு).name()
